{
  "anaconda": {
    "title": "Anaconda",
    "imgPath": "anaconda.svg",
    "importance": 2,
    "date": 2019,
    "proficiency": 3,
    "description": [
      {
        "title": "description",
        "text": "Anaconda is a popular open-source distribution of Python and R programming languages that includes a comprehensive collection of libraries and tools for data science, machine learning, and scientific computing."
      },
      {
        "title": "background",
        "text": "The current Anaconda setup on my laptop can support both R and Python at the same time, and holds some Python libraries that I have built over the years. But other than this convenience, Anaconda is slow to start up, and just causes additional confusion, so I don't use it as much.\nMy previous experience with Anaconda was during my <</portfolio/experience/data-analytics>>NS</>, where Anaconda was often used as the package manager. So I guess, I've debugged enough to be able to resolve simple Anaconda issues."
      }
    ],
    "related": [
      "portfolio/language/python",
      "portfolio/language/r",
      "portfolio/technology/jupyter",
      "portfolio/experience/data-analytics",
      "portfolio/module/cs2109s"
    ]
  },
  "angular-js": {
    "title": "Angular.js",
    "imgPath": "angular.svg",
    "importance": 2,
    "date": 2021,
    "proficiency": 2,
    "description": [
      {
        "title": "description",
        "text": "Angular is a powerful JavaScript framework for building robust and dynamic web applications with a focus on component-based architecture and seamless data binding."
      },
      {
        "title": "background",
        "text": "My least favourite out of the JavaScript frameworks I currently know, I've tried Angular to create the frontend of my card game. However, the size of the Angular application was too large for me to continue developing locally, and so I stopped using it entirely. I now mostly use React, which offers better support for libraries anyway."
      }
    ],
    "related": [
      "portfolio/language/javascript",
      "portfolio/language/typescript",
      "portfolio/skill/frontend-development",
      "portfolio/skill/web-development",
      "portfolio/coding/malls-of-singapore"
    ]
  },
  "aws": {
    "title": "AWS",
    "imgPath": "aws.svg",
    "importance": 2,
    "date": 2021,
    "proficiency": 2,
    "description": [
      {
        "title": "description",
        "text": "AWS is a leading cloud computing platform that provides a vast array of services and infrastructure to help businesses and developers build, deploy, and scale applications and services efficiently."
      },
      {
        "title": "background",
        "text": "I have brief experience with AWS when I took a course on it during my time in <</portfolio/experience/mom>>MOM</>. I've also tried deploying my backend APIs in AWS, but I am hesitant to involve money in my personal projects, for fear of receiving an oversized bill."
      }
    ],
    "related": [
      "portfolio/experience/data-management",
      "portfolio/skill/data-management",
      "portfolio/skill/web-development"
    ]
  },
  "blender": {
    "title": "Blender",
    "imgPath": "blender.svg",
    "importance": 1,
    "date": 2020,
    "proficiency": 2,
    "description": [
      {
        "title": "description",
        "text": "Blender is a free and open-source 3D modeling, animation, and rendering software. It offers a comprehensive set of tools and features for creating 3D artwork, visual effects, interactive applications, and more."
      },
      {
        "title": "background",
        "text": "I've learned Blender by following a series of tutorials online. I then went on to trying to create an MRT train model using the software. I suffered."
      }
    ]
  },
  "bootstrap": {
    "title": "Bootstrap",
    "imgPath": "bootstrap.svg",
    "importance": 4,
    "date": 2022,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "Bootstrap is a popular front-end framework that provides a collection of CSS styles, JavaScript components, and pre-built templates to help developers quickly and easily build responsive and visually appealing websites and web applications."
      },
      {
        "title": "background",
        "text": "My first experience with Bootstrap was when working on the <</portfolio/coding/note-together>>NoteTogether</> project, where Bootstrap was heavily used in designing the frontend. In particular, we had to design a Reddit-like main page, so Bootstrap was used to design the previews. Afterwards, I used Bootstrap during my internship, where the <</portfolio/technology/react-js>>React</> frontend was styled using Bootstrap. Extending that, we have this website, which also uses Bootstrap to enhance the React code. I've also tried Tailwind, but that is far less supported and documented than Bootstrap."
      }
    ],
    "related": [
      "portfolio/language/css",
      "portfolio/language/javascript",
      "portfolio/experience/fullstack-intern",
      "portfolio/skill/frontend-development",
      "portfolio/skill/web-development",
      "portfolio/coding/bus-routes-optimiser",
      "portfolio/coding/website-react"
    ]
  },
  "django": {
    "title": "Django",
    "imgPath": "django.svg",
    "importance": 7,
    "date": 2021,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "Django is a high-level Python web framework that follows the model-view-controller (MVC) architectural pattern. It provides a robust set of tools and libraries for building web applications, handling database operations, URL routing, form handling, authentication, and more."
      },
      {
        "title": "background",
        "text": "Django is by far my most used backend framework. This is mainly because most of the libraries I have created were written in Python, making it easier to import them into Django applications such as <</portfolio/coding/meetup-maker>>MeetupMaker</>. It is just much easier to get a simple application running, as compared to the more rigid frameworks found in other languages like <</portfolio/language/java>>Java</>, <</portfolio/language/go>>Go</> and <</portfolio/language/rust>>Rust</>. I'm sure that when the application becomes more complex, I will start to see the issues with Django. But for most of my development work, I love it."
      }
    ],
    "related": [
      "portfolio/language/python",
      "portfolio/skill/api-development",
      "portfolio/skill/web-development",
      "portfolio/coding/meetup-maker"
    ]
  },
  "er-studio": {
    "title": "ER Studio",
    "imgPath": "erstudio.png",
    "importance": 1,
    "date": 2021,
    "proficiency": 2,
    "description": [
      {
        "title": "description",
        "text": "ER Studio is a data modeling tool developed by Quest Software. It is used for designing, documenting, and managing entity-relationship (ER) diagrams and data models."
      },
      {
        "title": "background",
        "text": "During my time in <</portfolio/experience/data-management>>Enterprise Information Management</>, I was tasked with performing simple data modelling using ER Studio. But this was mostly guided, so I don't feel like I learned or accomplished much during that period of time."
      }
    ],
    "related": [
      "portfolio/experience/data-management",
      "portfolio/skill/data-management",
      "portfolio/skill/data-modeling"
    ]
  },
  "excel": {
    "title": "Microsoft Excel",
    "imgPath": "excel.svg",
    "importance": 3,
    "date": 2019,
    "proficiency": 8,
    "description": [
      {
        "title": "description",
        "text": "Microsoft Excel is a popular spreadsheet application that allows users to organise, analyse, and manipulate data using formulas, functions, charts, and tables."
      },
      {
        "title": "background",
        "text": "Microsoft Excel is basic knowledge for any job that involves computers. But I think my most impactful experience with Excel comes during my time in <</portfolio/experience/data-analytics>>Data Analytics</>, where I used <</portfolio/technology/pandas>>Pandas</> to preprocess and manipulate data stored within Excel files. Besides that, I am decent at using excel formulas, macros as well as VBA, but I wouldn't say that I'm close to mastering them (since they are better done using proper programming languages). Nevertheless, Excel is ok."
      }
    ],
    "related": [
      "portfolio/module/gea1000",
      "portfolio/experience/data-analytics",
      "portfolio/experience/data-management",
      "portfolio/skill/data-management",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/geospatial-analytics",
      "portfolio/skill/operational-analysis"
    ]
  },
  "express-js": {
    "title": "Express.js",
    "imgPath": "express.svg",
    "importance": 2,
    "date": 2022,
    "proficiency": 4,
    "description": [
      {
        "title": "description",
        "text": "Express.js is a minimalistic and flexible web application framework for Node.js that simplifies the development of server-side applications."
      },
      {
        "title": "background",
        "text": "I used Express.js when developing the <</portfolio/coding/note-together>>NoteTogether</> application. It was a lot of work, but there's nothing much else."
      }
    ],
    "related": [
      "portfolio/language/javascript",
      "portfolio/coding/note-together",
      "portfolio/module/cp2106"
    ]
  },
  "figma": {
    "title": "Figma",
    "imgPath": "figma.svg",
    "importance": 8,
    "date": 2021,
    "proficiency": 8,
    "description": [
      {
        "title": "description",
        "text": "Figma is a collaborative web application for interface design, with additional offline features enabled by desktop applications for macOS and Windows."
      },
      {
        "title": "background",
        "text": "As part of the hell that is CS3216, I have gotten used to using Figma to draft out initial designs for an application. This is further reinforced by the Google UX Design course, which required Figma for the capstone project."
      }
    ],
    "related": [
      "portfolio/certificate/google-ux-design",
      "portfolio/skill/ux-design"
    ]
  },
  "flask": {
    "title": "Flask",
    "imgPath": "flask.svg",
    "importance": 7,
    "date": 2019,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "Flask is a lightweight web framework written in <</portfolio/language/python>>Python</> that allows you to build web applications quickly and efficiently."
      },
      {
        "title": "background",
        "text": "My first introduction to Flask was during my <</portfolio/experience/data-analytics>>NS</>, where I had to maintain a piece of <</portfolio/coding/dynamic-resource-optimiser>>optimisation software</> written in Flask. At the same time, I developed a Flask application for searching music chords, serving as the application layer for a Python script that I made previously. I still prefer Django, though, as I am now more familiar with it than with Flask."
      }
    ],
    "related": [
      "portfolio/language/python",
      "portfolio/experience/data-analytics",
      "portfolio/skill/api-development",
      "portfolio/skill/web-development",
      "portfolio/coding/chords-search-engine",
      "portfolio/coding/dynamic-resource-optimiser",
      "portfolio/coding/malls-of-singapore"
    ]
  },
  "gcp": {
    "title": "GCP",
    "imgPath": "gcp.svg",
    "importance": 5,
    "date": 2019,
    "proficiency": 4,
    "description": [
      {
        "title": "description",
        "text": "GCP (Google Cloud Platform) is a suite of cloud computing services offered by Google that provides scalable infrastructure, data storage, machine learning capabilities, and a wide range of other tools and services to help businesses build, deploy, and manage applications and services in the cloud."
      },
      {
        "title": "background",
        "text": "All of my active Telegram Bots are written in Google Apps Script and deployed on Google Cloud Platform. Apart from that, I've tried delving into cloud computing, but I'm scared of being overcharged for their services. So I mostly work on local now, ever since Heroku free tier got taken down."
      }
    ],
    "related": [
      "portfolio/experience/data-analytics",
      "portfolio/skill/web-development",
      "portfolio/language/javascript",
      "portfolio/technology/telegram-bots",
      "portfolio/coding/halal-recommender",
      "portfolio/coding/notes-telegram-bot"
    ]
  },
  "github": {
    "title": "GitHub",
    "imgPath": "github.svg",
    "importance": 8,
    "date": 2019,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "GitHub is a web-based platform that provides version control and collaboration features for software development projects, allowing developers to host, manage, and share their code repositories, track changes, and facilitate team collaboration through features like pull requests, issue tracking, and code reviews."
      },
      {
        "title": "background",
        "text": "The bulk of my GitHub knowledge comes from my experience in my <</portfolio/module/cs2103t>>CS2103T Software Engineering</> module, where we had to work in a team to develop a Java product. In this module, I was very motivated, and made full use of GitHub's features. From its feature tracker, CI/CD, as well as the PR review system (where I commented over 300 times on other developers' PRs). Apart from this, my internship used GitHub for version control so there's that."
      }
    ],
    "related": [
      "portfolio/coding/auto-gitter",
      "portfolio/coding/note-together",
      "portfolio/module/cs2103t"
    ]
  },
  "heroku": {
    "title": "Heroku",
    "imgPath": "heroku.svg",
    "importance": 3,
    "date": 2022,
    "proficiency": 3,
    "description": [
      {
        "title": "description",
        "text": "Heroku is a cloud platform that enables developers to deploy, manage, and scale applications effortlessly."
      },
      {
        "title": "background",
        "text": "Before its free tier was taken down, I deployed 5 applications on Heroku during my web development phase. This includes setting up environment variables and CI/CD. But ever since the free tier is gone, I have stopped deploying my projects altogether."
      }
    ],
    "related": [
      "portfolio/coding/meetup-maker",
      "portfolio/coding/note-together",
      "portfolio/module/cp2106"
    ]
  },
  "intellij": {
    "title": "IntelliJ",
    "imgPath": "intellij.svg",
    "importance": 3,
    "date": 2022,
    "proficiency": 5,
    "description": [
      {
        "title": "description",
        "text": "IntelliJ IDEA is a feature-rich and highly customizable integrated development environment (IDE) that empowers developers with intelligent coding assistance, productivity tools, and seamless integration, enabling them to efficiently build and maintain software projects."
      },
      {
        "title": "background",
        "text": "As for my experience in using IntelliJ, I heavily used it during my <</portfolio/module/cs2103t>>CS2103T Software Engineering</> module, where the team is tasked with developing a small Java application. Through my 18,000 lines of contributed code, I can safely say that I have used IntelliJ enough to give myself a median proficiency level.\nBesides Java, I also use IntelliJ for my Rust projects, as it makes the entire development process much easier."
      }
    ],
    "related": [
      "portfolio/language/java",
      "portfolio/language/rust"
    ]
  },
  "jest": {
    "title": "Jest",
    "imgPath": "jest.svg",
    "importance": 2,
    "date": 2023,
    "proficiency": 1,
    "description": [
      {
        "title": "description",
        "text": "Jest is a popular JavaScript testing framework that provides a simple and efficient way to write and execute unit tests, enabling developers to ensure the correctness and reliability of their code."
      },
      {
        "title": "background",
        "text": "I used Jest for testing the application that I developed during my internship."
      }
    ],
    "related": [
      "portfolio/experience/fullstack-intern",
      "portfolio/coding/bus-routes-optimiser",
      "portfolio/language/javascript"
    ]
  },
  "junit": {
    "title": "JUnit",
    "imgPath": "junit.svg",
    "importance": 5,
    "date": 2023,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "JUnit is a widely-used testing framework for Java that allows developers to write and execute unit tests, enabling automated testing and ensuring the quality and correctness of Java applications."
      },
      {
        "title": "background",
        "text": "I mainly used JUnit testing during my <</portfolio/module/cs2103t>>CS2103T Software Engineering</> module, where I wrote over 9,000 lines of test code, to achieve close to 100% test coverage. So I think I'm quite comfortable using it by now."
      }
    ],
    "related": [
      "portfolio/module/cs2103t",
      "portfolio/coding/edumate",
      "portfolio/language/java"
    ]
  },
  "jupyter": {
    "title": "Jupyter",
    "imgPath": "jupyter.svg",
    "importance": 4,
    "date": 2019,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "Jupyter is an open-source web application that allows you to create and share documents containing live code, equations, visualisations, and explanatory text, making it an interactive and versatile environment for data exploration, analysis, and scientific computing."
      },
      {
        "title": "background",
        "text": "I use Jupyter Notebook very extensively throughout my <</portfolio/experience/data-analytics>>NS</> life and beyond. Indeed, before developing in VSCode, I test out my Python scripts in Jupyter to make sure they work, before properly putting all the pieces together in VSCode.\nBesides Python development, I also conduct all of my data science projects and visualisations in Jupyter Notebook. There is simply no other option but to do so. With over 100 notebooks, I can safely say that I am quite familiar with using Jupyter to work on my personal projects."
      }
    ],
    "related": [
      "portfolio/language/python",
      "portfolio/language/r",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/web-scraping",
      "portfolio/coding/mrt-paths-analysis"
    ]
  },
  "mongo-db": {
    "title": "MongoDB",
    "imgPath": "mongo.svg",
    "importance": 4,
    "date": 2022,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "MongoDB is a popular NoSQL database management system that provides a flexible and scalable platform for storing and retrieving data, using a document-oriented approach, making it suitable for a wide range of applications and use cases."
      },
      {
        "title": "background",
        "text": "I took a couple of free courses on Mongo University (such as Data Modeling) to learn the technology. As for development work, I did most of the database design in the <</portfolio/coding/note-together>>NoteTogether</> project, which was a MEVN application with complex functionality. I am also quite familiar with Mongoose, as well as working with Mongo Atlas (which is the free online service in Mongo). Overall, it was relatively easy to set up and maintain, which made it suitable as my first deployed database."
      }
    ],
    "related": [
      "portfolio/language/javascript",
      "portfolio/module/cp2106",
      "portfolio/coding/note-together",
      "portfolio/skill/data-modeling",
      "portfolio/certificate/mongo-data-modeling"
    ]
  },
  "musescore": {
    "title": "MuseScore",
    "imgPath": "musescore.svg",
    "importance": 3,
    "date": 2019,
    "proficiency": 9,
    "description": [
      {
        "title": "description",
        "text": "MuseScore is a free and open-source music notation software that enables musicians and composers to create, edit, and share sheet music with a comprehensive set of tools and features for notation, playback, and layout customisation."
      },
      {
        "title": "background",
        "text": "MuseScore is the software that I use to create my music scores. Besides sharing them on the MuseScore platform, I also use either the Synthesia or Neothesia applications to create piano tutorials that I share on my <<https://www.youtube.com/c/izzhafeez>>Youtube Channel</>. With over 200 scores created on MuseScore, I have become quite familiar with its features and its shortcuts."
      }
    ]
  },
  "node-js": {
    "title": "Node.js",
    "imgPath": "node.svg",
    "importance": 3,
    "date": 2022,
    "proficiency": 5,
    "description": [
      {
        "title": "description",
        "text": "Node.js is a JavaScript runtime environment that allows developers to run server-side JavaScript applications, providing an event-driven, non-blocking I/O model for building scalable and efficient network applications."
      },
      {
        "title": "background",
        "text": "I only used Node.js when developing the <</portfolio/coding/note-together>>NoteTogether</> application. It was still a lot of API routing to be done, but it was quite effective."
      }
    ],
    "related": [
      "portfolio/language/javascript",
      "portfolio/skill/api-development",
      "portfolio/skill/web-development",
      "portfolio/module/cp2106",
      "portfolio/coding/note-together"
    ]
  },
  "pandas": {
    "title": "Pandas",
    "imgPath": "pandas.svg",
    "importance": 10,
    "date": 2019,
    "proficiency": 10,
    "description": [
      {
        "title": "description",
        "text": "Pandas is a powerful data manipulation and analysis library for Python that provides convenient data structures and functions to efficiently clean, transform, and analyse structured data, making it a popular choice for data science and data analysis tasks."
      },
      {
        "title": "background",
        "text": "Pandas is by far my most used programming tool. It started during my <</portfolio/experience/data-analytics>>NS</> in 2019, where I learned to work with csv and excel files properly. At the time, I used Pandas for all sorts of tasks. I mainly used it for <</portfolio/skill/operational-analysis>>Operational Analysis</>, where I first cleaned the data before performing visualizations. But I also used it for data compilation, where I created pipelines to produce analytics reports and master files. Nowadays, I use Pandas in nearly every single one of my projects, and all my datasets were created with the help of Pandas.\nWith Polars releasing soon, however, I don't know whether I will switch completely."
      }
    ],
    "related": [
      "portfolio/language/python",
      "portfolio/skill/data-cleaning",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/operational-analysis",
      "portfolio/module/cs2109s",
      "portfolio/experience/data-analytics",
      "portfolio/coding/dynamic-resource-optimiser",
      "portfolio/coding/geospatial-extraction",
      "portfolio/coding/geospatial-management",
      "portfolio/coding/malls-of-singapore",
      "portfolio/coding/svg-converter"
    ]
  },
  "plant-uml": {
    "title": "PlantUML",
    "imgPath": "plantuml.svg",
    "importance": 5,
    "date": 2023,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "PlantUML is an open-source tool that allows developers and system architects to create UML (Unified Modeling Language) diagrams using a simple and intuitive textual syntax, facilitating the visualisation and documentation of software systems and their components."
      },
      {
        "title": "background",
        "text": "The bulk of my PlantUML knowledge comes from my <</portfolio/module/cs2103t>>CS2103T Software Engineering</> module, where groups have to document their code using PlantUML. <<https://ay2223s2-cs2103t-w14-2.github.io/tp/DeveloperGuide.html>>Here is ours</>. We had to create Class, Object, Sequence and Activity Diagrams."
      }
    ],
    "related": [
      "portfolio/module/cs2103t",
      "portfolio/skill/documentation",
      "portfolio/coding/edumate"
    ]
  },
  "postgresql": {
    "title": "PostgreSQL",
    "imgPath": "postgresql.svg",
    "importance": 7,
    "date": 2022,
    "proficiency": 8,
    "description": [
      {
        "title": "description",
        "text": "PostgreSQL is an advanced open-source relational database management system that offers robust features, scalability, and extensibility, making it a reliable choice for storing and managing structured data in various applications."
      },
      {
        "title": "background",
        "text": "I used PostgreSQL during my time in <</portfolio/experience/data-management>>Enterprise Information Management</>, where I worked on data pipelines. I also used it for my <</portfolio/module/cs2102>>CS2102 Database Systems</> module, where we worked with PostgreSQL along with PGAdmin to complete our group projects."
      }
    ],
    "related": [
      "portfolio/module/cs2102",
      "portfolio/experience/data-management",
      "portfolio/language/sql",
      "portfolio/coding/meetup-maker"
    ]
  },
  "postman": {
    "title": "Postman",
    "imgPath": "postman.svg",
    "importance": 7,
    "date": 2022,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "Postman is a popular collaboration platform and API development tool that simplifies the process of designing, testing, and documenting APIs, allowing developers to streamline their API workflows and facilitate effective communication among team members."
      },
      {
        "title": "background",
        "text": "For the <</portfolio/coding/note-together>>NoteTogether</> project, I comprehensively tested our backend API, performing <</portfolio/skill/software-testing>>Unit, Integration and System testing</>. This testing was good enough for our project to be considered for the highest level of achievement (Artemis).\nDespite its ease of use on small-scale testing, it does slow down a lot as it is a web program. As such, I'd much rather use Python's Request library to run the tests."
      }
    ],
    "related": [
      "portfolio/skill/api-development",
      "portfolio/skill/software-testing",
      "portfolio/skill/web-development",
      "portfolio/module/cp2106",
      "portfolio/coding/bus-routes-optimiser",
      "portfolio/coding/note-together",
      "portfolio/experience/fullstack-intern"
    ]
  },
  "power-bi": {
    "title": "PowerBI",
    "imgPath": "power-bi.svg",
    "importance": 4,
    "date": 2021,
    "proficiency": 4,
    "description": [
      {
        "title": "description",
        "text": "PowerBI is a business analytics and data visualisation platform by Microsoft that empowers organisations to analyze data, share insights, and make data-driven decisions through interactive and visually compelling dashboards and reports."
      },
      {
        "title": "background",
        "text": "I used PowerBI during my time in <</portfolio/experience/data-management>>Enterprise Information Management</> where I was tasked with creating dashboards for displaying foreign workers data. I had a good mentor that helped me learn the fundamentals of dashboard design, as well as how to properly write the necessary queries whilst not overloading the database server with 'select *' requests."
      }
    ],
    "related": [
      "portfolio/experience/data-management",
      "portfolio/skill/data-management",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/operational-analysis"
    ]
  },
  "pytorch": {
    "title": "Pytorch",
    "imgPath": "pytorch.svg",
    "importance": 3,
    "date": 2023,
    "proficiency": 3,
    "description": [
      {
        "title": "description",
        "text": "PyTorch is a widely-used open-source machine learning framework that provides a flexible and efficient platform for building and training neural networks, enabling developers and researchers to create powerful deep learning models with ease."
      },
      {
        "title": "background",
        "text": "I only used Pytorch for the <</portfolio/module/cs2109s>>CS2109S Introduction to AI and ML</> module, where knowledge of the technology was expected. The finals also used Pytorch, so I'd say that's where I got my experience from."
      }
    ],
    "related": [
      "portfolio/module/cs2109s",
      "portfolio/language/python",
      "portfolio/skill/data-science",
      "portfolio/skill/machine-learning"
    ]
  },
  "qgis": {
    "title": "QGIS",
    "imgPath": "qgis.svg",
    "importance": 2,
    "date": 2020,
    "proficiency": 4,
    "description": [
      {
        "title": "description",
        "text": "QGIS (Quantum GIS) is a free and open-source geographic information system (GIS) software that allows users to visualise, analyse, and manage spatial data, making it a valuable tool for mapping, geospatial analysis, and cartographic projects."
      },
      {
        "title": "background",
        "text": "I was introduced to QGIS in 2019, where I had to create visualisations of geospatial data (I think it was for MyResponder). Afterwards, I used it a couple more times during <</portfolio/experience/data-analytics>>NS</> for various other projects.\nAfter NS, I used QGIS to create visualisations for a data analytics competition, which involved Grab data."
      }
    ],
    "related": [
      "portfolio/experience/data-analytics",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/geospatial-analytics",
      "portfolio/skill/operational-analysis"
    ]
  },
  "r-markdown": {
    "title": "R Markdown",
    "imgPath": "r-studio.svg",
    "date": 2019,
    "description": [
      {
        "title": "description",
        "text": "R Markdown provides an unified authoring framework for data science, combining your code, its results, and your prose commentary. R Markdown documents are fully reproducible and support dozens of output formats, like PDFs, Word files, slideshows, and more."
      }
    ],
    "related": [
      "portfolio/course/data-analysis-with-r"
    ]
  },
  "r-studio": {
    "title": "R Studio",
    "imgPath": "r-studio.svg",
    "date": 2019,
    "description": [
      {
        "title": "description",
        "text": "RStudio is an integrated development environment for R, a programming language for statistical computing and graphics. It is available in two formats: RStudio Desktop is a regular desktop application while RStudio Server runs on a remote server and allows accessing RStudio using a web browser."
      }
    ],
    "related": [
      "portfolio/course/data-analysis-with-r"
    ]
  },
  "react-js": {
    "title": "React.js",
    "imgPath": "react.svg",
    "importance": 9,
    "date": 2022,
    "proficiency": 8,
    "description": [
      {
        "title": "description",
        "text": "React.js is a JavaScript library for building user interfaces that enables developers to create reusable UI components and efficiently manage the dynamic rendering of data, leading to fast and interactive web applications."
      },
      {
        "title": "background",
        "text": "React.js has become my primary frontend framework, starting from 2022 when I built my personal website using React. Since then, I have utilised React extensively for various projects, including the current version of my website you are viewing. During my <</portfolio/experience/fullstack-intern>>internship</>, I leveraged React to develop a geospatial API web application, gaining valuable experience in request handling, form validation, and error handling with tools like **Formik** and **Yup**. This journey has deepened my understanding and appreciation for React's capabilities and its role in creating dynamic and robust web applications."
      }
    ],
    "related": [
      "portfolio/language/javascript",
      "portfolio/coding/bus-routes-optimiser",
      "portfolio/coding/website-react",
      "portfolio/experience/fullstack-intern",
      "portfolio/skill/frontend-development",
      "portfolio/skill/web-development"
    ]
  },
  "rocket-rs": {
    "title": "Rocket.rs",
    "imgPath": "rocket.svg",
    "importance": 3,
    "date": 2023,
    "proficiency": 3,
    "description": [
      {
        "title": "description",
        "text": "Rocket.rs is a web framework for the Rust programming language that emphasises simplicity, performance, and ease of use, allowing developers to build secure and fast web applications with minimal configuration and boilerplate code."
      },
      {
        "title": "background",
        "text": "I utilised Rocket.rs to create my Travel Optimiser application, which aimed to provide route suggestions for reaching specific destinations. I am currently in the process of enhancing my knowledge and skills in this technology as I continue to explore its capabilities and dive deeper into its implementation."
      }
    ],
    "related": [
      "portfolio/language/rust",
      "portfolio/skill/api-development",
      "portfolio/skill/web-development"
    ]
  },
  "ruby-on-rails": {
    "title": "Ruby on Rails",
    "imgPath": "rails.svg",
    "importance": 6,
    "date": 2019,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "Ruby on Rails is a popular web application framework written in <</portfolio/language/ruby>>Ruby</> that follows the MVC architectural pattern, providing developers with a productive environment for building robust and scalable web applications with convention-over-configuration principles."
      },
      {
        "title": "background",
        "text": "Firstly, I was involved in the development, maintenance and operation of an optimisation software, where part of it was written in Rails. Naturally, I had to pick it up and make modifications and fixes along the way in order to continue operating the software.\nSecondly, during my <</portfolio/experience/fullstack-intern>>internship</>, I also used Rails to serve as the backend for a web application that showcased the compeny's geospatial APIs. Through these two experiences, I became more familiar with Rails."
      }
    ],
    "related": [
      "portfolio/language/ruby",
      "portfolio/experience/data-analytics",
      "portfolio/experience/fullstack-intern",
      "portfolio/coding/bus-routes-optimiser",
      "portfolio/coding/dynamic-resource-optimiser"
    ]
  },
  "selenium": {
    "title": "Selenium",
    "imgPath": "selenium.svg",
    "importance": 6,
    "date": 2019,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "Selenium is a popular open-source framework that enables automated web browser testing, providing a way to interact with web elements, simulate user actions, and validate expected behaviors in web applications."
      },
      {
        "title": "background",
        "text": "I mainly use Selenium to test out the frontend of my web applications, such as the <</portfolio/coding/note-together>>NoteTogether</> application. Besides that, I sometimes use Selenium to perform <</portfolio/skill/web-scraping>>web-scraping</>, but I mostly just use my <</portfolio/coding/spiderman>>SpiderMan</> web scraper to do so, as it is much easier for me to use."
      }
    ],
    "related": [
      "portfolio/skill/software-testing",
      "portfolio/skill/web-scraping",
      "portfolio/language/python",
      "portfolio/coding/malls-of-singapore",
      "portfolio/coding/note-together",
      "portfolio/coding/sentence-searcher"
    ]
  },
  "spring": {
    "title": "Spring",
    "imgPath": "spring.svg",
    "importance": 1,
    "date": 2022,
    "proficiency": 1,
    "description": [
      {
        "title": "description",
        "text": "Spring Boot is a powerful Java-based framework that simplifies the development of standalone, production-grade applications by providing a streamlined platform with auto-configuration, embedded servers, and a range of powerful features for rapid application development."
      },
      {
        "title": "background",
        "text": "I only have minimal knowledge of Java Spring, as I followed a tutorial online. I haven't created anything worth bringing up."
      }
    ],
    "related": [
      "portfolio/language/java",
      "portfolio/skill/api-development",
      "portfolio/skill/web-development"
    ]
  },
  "ssms": {
    "title": "SSMS",
    "imgPath": "ssms.png",
    "importance": 3,
    "date": 2021,
    "proficiency": 2,
    "description": [
      {
        "title": "description",
        "text": "SSMS (SQL Server Management Studio) is a comprehensive integrated environment by Microsoft for managing and administering SQL Server databases, offering a wide range of tools and features for database development, querying, debugging, and performance optimisation."
      },
      {
        "title": "background",
        "text": "I used SSMS when creating data pipelines for my role in <</portfolio/experience/data-management>>Enterprise Information Management</>."
      }
    ],
    "related": [
      "portfolio/language/sql",
      "portfolio/experience/data-management",
      "portfolio/skill/data-management",
      "portfolio/skill/data-modeling"
    ]
  },
  "sublime": {
    "title": "Sublime",
    "imgPath": "sublime.svg",
    "importance": 3,
    "date": 2019,
    "proficiency": 4,
    "description": [
      {
        "title": "description",
        "text": "Sublime Text is a lightweight yet powerful text editor known for its speed, versatility, and extensive plugin ecosystem, making it a popular choice among developers for writing code and editing text with advanced features and customisation options."
      },
      {
        "title": "background",
        "text": "I used the Sublime text editor during my time in <</portfolio/experience/data-analytics>>NS</>, as that was the editor available to me at the time. For both Python and Ruby code, Sublime was the go-to option for development work. Nothing much else to it."
      }
    ],
    "related": [
      "portfolio/experience/data-analytics"
    ]
  },
  "svelte-js": {
    "title": "Svelte.js",
    "imgPath": "svelte.svg",
    "importance": 2,
    "date": 2022,
    "proficiency": 2,
    "description": [
      {
        "title": "description",
        "text": "Svelte is a modern JavaScript framework that compiles components at build time, resulting in highly efficient and lightweight applications, with a focus on simplicity and performance."
      },
      {
        "title": "background",
        "text": "I have experimented with Svelte to create simple web applications such as a calculator and a to-do list. These were heavily guided, so I wouldn't say that I'm comfortable with using Svelte on a day-to-day basis."
      }
    ],
    "related": [
      "portfolio/language/javascript",
      "portfolio/skill/frontend-development",
      "portfolio/skill/web-development"
    ]
  },
  "tableau": {
    "title": "Tableau",
    "imgPath": "tableau.svg",
    "importance": 4,
    "date": 2020,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "Tableau is a leading data visualisation and business intelligence platform that allows users to explore, analyse, and present data in visually compelling and interactive dashboards, enabling data-driven decision-making and insights."
      },
      {
        "title": "background",
        "text": "The main bulk of my Tableau experience comes from my time in <</portfolio/experience/data-analytics>>NS</>, where I had to do up a few dashboards and create a few visualisations to aid the higher-ups in making informed decisions. One of the more memorable projects that the team needed to do was to create a dashboard for fire alarm data, which helps the Ops team figure out trends and anomalies in the data."
      }
    ],
    "related": [
      "portfolio/experience/data-analytics",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/operational-analysis",
      "portfolio/coding/dynamic-resource-optimiser"
    ]
  },
  "telegram-bots": {
    "title": "Telegram Bots",
    "imgPath": "telegram.svg",
    "importance": 4,
    "date": 2020,
    "proficiency": 7,
    "description": [
      {
        "title": "description",
        "text": "Telegram bots are automated programs that interact with users on the Telegram messaging platform, offering a wide range of functionalities such as providing information, performing tasks, sending notifications, and facilitating interactive experiences."
      },
      {
        "title": "background",
        "text": "Telegram Bots allow me to do various tasks when I'm not at home, which has since improved my productivity during long commutes. As such, I made quite a lot of Telegram Bots for different things. For example, some Bots are used for language-learning, some Bots are for finding Halal food, some Bots are for studying course material."
      }
    ],
    "related": [
      "portfolio/technology/gcp",
      "portfolio/coding/halal-recommender",
      "portfolio/coding/notes-telegram-bot",
      "portfolio/language/javascript"
    ]
  },
  "tensorflow": {
    "title": "TensorFlow",
    "imgPath": "tensorflow.svg",
    "importance": 6,
    "date": 2020,
    "proficiency": 5,
    "description": [
      {
        "title": "description",
        "text": "TensorFlow is a popular open-source deep learning framework that allows developers to build and deploy machine learning models efficiently, providing a flexible platform for training, inference, and deployment of neural networks across a wide range of applications."
      },
      {
        "title": "background",
        "text": "Although I've used TensorFlow quite a lot over the past few years, there's still so much to learn. Mainly because AI/ML is such a deep topic, so I can't say I'm that proficient at it. Sure, if you allow me to Google things, then I can do pretty well, but without access to Internet, I forget much of the basic syntax, and can't even do simple tasks."
      }
    ],
    "related": [
      "portfolio/language/python",
      "portfolio/certificate/deep-learning-tensorflow",
      "portfolio/skill/data-science",
      "portfolio/skill/data-visualisation",
      "portfolio/skill/machine-learning"
    ]
  },
  "unity": {
    "title": "Unity",
    "imgPath": "unity.svg",
    "importance": 2,
    "date": 2020,
    "proficiency": 1,
    "description": [
      {
        "title": "description",
        "text": "Unity is an all purpose game engine that supports 2D and 3D graphics and scripting through C#."
      },
      {
        "title": "background",
        "text": "My experience with Unity was very brief, as I've only experimented with it a couple of times (mainly trying to develop my malls card game)."
      }
    ],
    "related": [
      "portfolio/language/c-sharp",
      "portfolio/skill/game-development",
      "portfolio/coding/malls-of-singapore"
    ]
  },
  "vex": {
    "title": "VEX Robotics",
    "imgPath": "vex.png",
    "importance": 3,
    "date": 2017,
    "proficiency": 5,
    "description": [
      {
        "title": "description",
        "text": "VEX Robotics is an educational platform that inspires and engages students in robotics and STEM fields by providing them with a versatile robotics kit, competitions, and resources to develop their problem-solving and engineering skills."
      },
      {
        "title": "background",
        "text": "VEX Robotics was a major part of my short Robotics journey. After all, the club did participate in a VEX competition, and held some events of our own. But I think my main contribution to the team would be teaching the juniors how to code in RobotC, which was the language used to program the robots. Besides that, I've mostly forgotten how to use VEX."
      }
    ],
    "related": [
      "portfolio/experience/robotics"
    ]
  },
  "vscode": {
    "title": "VS Code",
    "imgPath": "vscode.svg",
    "importance": 2,
    "date": 2021,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "VSCode (Visual Studio Code) is a lightweight yet powerful source code editor that offers a rich set of features, extensions, and customization options, making it a popular choice for developers to write code efficiently and effectively across various programming languages and platforms."
      },
      {
        "title": "background",
        "text": "VSCode is my most used code editor, and I have created add-ons of my own. But that's pretty much it."
      }
    ],
    "related": [
      "portfolio/experience/fullstack-intern"
    ]
  },
  "vue-js": {
    "title": "Vue.js",
    "imgPath": "vue.svg",
    "importance": 5,
    "date": 2022,
    "proficiency": 6,
    "description": [
      {
        "title": "description",
        "text": "Vue.js is a progressive <</portfolio/language/javascript>>JavaScript</> framework for building user interfaces, known for its simplicity, flexibility, and reactivity, allowing developers to create interactive and scalable web applications with ease."
      },
      {
        "title": "background",
        "text": "For <</portfolio/coding/note-together>>NoteTogether</>, my partner and I decided to use Vue.js as our frontend framework. Despite the great reviews, this turned out to be a difficult experience, as many packages lacked support in Vue; we had to make do with what's available. Despite this, I'm glad our combined frontend skills were sufficient in producing a neat final design."
      }
    ],
    "related": [
      "portfolio/module/cp2106",
      "portfolio/language/javascript",
      "portfolio/coding/note-together",
      "portfolio/skill/frontend-development",
      "portfolio/skill/web-development"
    ]
  }
}