{
  "wavescan-software-engineering": {
    "title": "Software Engineering Intern",
    "organisation": "WaveScan Technologies",
    "duration": "May 2024 - Aug 2024",
    "overview": "Streamlined operations by unifying various robotic control applications into a single platform written in Electron and Svelte. Enabled rapid, actionable insights and improved decision-making by implementing real-time data visualisations using D3 and VTK. Migrated IPv4 routes to IPv6 on the Amazon Web Services (AWS) platform.",
    "related": [
      "Svelte",
      "Electron",
      "TypeScript",
      "AWS"
    ]
  },
  "qi-software-engineering": {
    "title": "Software Engineering Intern",
    "organisation": "Quantum Inventions",
    "duration": "May 2023 - Aug 2023",
    "overview": "Enhanced client acquisition by developing an API showcase platform developed in React and Rails. Improved the visual experience for users by implementing an interactive OpenLayers map for demonstrating API outputs.",
    "related": [
      "React",
      "Ruby",
      "Ruby on Rails",
      "Software Testing",
      "Web Development"
    ]
  },
  "mom-data-management": {
    "title": "Data Management",
    "organisation": "Ministry of Manpower",
    "duration": "Feb 2021 - Jul 2021",
    "overview": "Promoted good data governance practices to 2400+ employees by translating technical documents into accessible language for a non-technical audience. Facilitated analysis of foreign worker dormitory data by developing PowerBI dashboards, ERStudio data models, and ETL scripts on Oracle. Achieved 82% speed-up in monthly reporting of user accounts data by implementing scripts and functions in Excel.",
    "related": [
      "SQL",
      "ER Studio",
      "Power BI",
      "SSMS",
      "Data Visualisation"
    ]
  },
  "scdf-data-analytics": {
    "title": "Data Analytics",
    "organisation": "Singapore Civil Defence Force",
    "duration": "Feb 2019 - Jan 2021",
    "overview": "Shortened Singapore’s emergency response times during COVID by enhancing and leveraging a resource optimisation application written in Flask. Achieved 88% speed-up and 96% reduction in Google API costs by implementing location-caching strategies using Python. Future-proofed Singapore’s emergency response times by projecting 13-year performance and proposing future placement of fire bases and appliances. Improved ease of maintenance of 7 data cleaning scripts by migrating them from R to Python. Facilitated auditing and analysis of call centre data by designing a recommendation engine in Python that identified 43 anomalies. Investigated the root causes of false fire alarms by working in a team of 4 to analyse and visualise data using Tableau. Ensured continuity of work output by training and mentoring 4 juniors in data science projects.",
    "related": [
      "Python",
      "Pandas",
      "R",
      "Tableau",
      "Data Analytics",
      "Dynamic Resource Optimiser"
    ]
  },
  "vrmc-robotics": {
    "title": "Programming Head",
    "organisation": "Victoria Robotics-Makers Club",
    "duration": "Jun 2017 - May 2018",
    "overview": "Organised and conducted training sessions on programming in Python and C, preparing club members to participate in various robotics and programming competitions. Played a pivotal role in planning and executing an annual club orientation camp, showcasing quick-thinking skills by improvising and implementing backup activities.",
    "related": [
      "Python",
      "VEX Robotics"
    ]
  }
}