{
  "binary": {
    "title": "Binary Quest",
    "heroText": "Answer yes or no, simple as that! Try to get a high streak!"
  },
  "blurry": {
    "title": "Blurry Vision",
    "heroText": "Guess what the blurred text says. The more accurate your guess, the higher your score!"
  },
  "color": {
    "title": "ColorGuessr",
    "heroText": "Guess the hexcode of the given color. Try to get an accurate guess!"
  },
  "compare": {
    "title": "Comparator",
    "heroText": "Compare the two items and guess which one has the greater value. Try to get the highest streak that you can."
  },
  "connect": {
    "title": "Category Connect",
    "heroText": "Group tiles that share a common category. Match all four tiles to win!"
  },
  "geoguessr": {
    "title": "GeoGuessr",
    "heroText": "Guess where I took these photos! When you're ready, make your guess and see how close you were."
  },
  "jumble": {
    "title": "Jumble Jam",
    "heroText": "Unscrambling but on steroids! Separate the jumbled letters to form many words at once!"
  },
  "map": {
    "title": "Map Mania",
    "heroText": "How many locations can you name in a short time?"
  },
  "match": {
    "title": "Match Master",
    "heroText": "Match tiles that are part of the same group. Try to complete all pairings as quickly as possible!"
  },
  "pie": {
    "title": "Pie Chart Puzzle",
    "heroText": "Given a random pie chart, guess what the chart represents! MCQ of course."
  },
  "position": {
    "title": "Position Puzzle",
    "heroText": "Given random points on a blank map, must match them to their correct IRL locations!"
  },
  "rank": {
    "title": "Rank Master",
    "heroText": "Rank the items in the correct order. Try to be accurate with your ranking!"
  },
  "regex": {
    "title": "Regex Warrior",
    "heroText": "Find the shortest regex that perfectly matches the given strings. The shorter the better!"
  },
  "selection": {
    "title": "Selection Showdown",
    "heroText": "Select all the correct answers from the list. Try to get a high score!"
  },
  "streak": {
    "title": "Streak Master",
    "heroText": "How many answers can you get in a row? Test your knowledge with these quizzes and see how high of a streak you can get!"
  }
}