[
  "\u4e0d\u8d77",
  "\u4e0b\u6765",
  "\u4e0b\u6765",
  "\u4e0d\u5f97",
  "\u5341\u5206",
  "\u4e0d\u60f3",
  "\u636e\u6211\u6240\u77e5",
  "\u4e0d\u4e86",
  "\u4e0d\u4e86",
  "\u4e0d\u5bb9",
  "\u4e0d\u4e0b",
  "\u63a5\u4e0b\u6765",
  "\u9760\u8fd1",
  "\u4e0b\u4e00\u4e2a",
  "\u4e0d\u7531",
  "\u8bf4\u5b9e\u8bdd",
  "\u8fc7\u6765",
  "\u76f8\u5bf9\u6765\u8bf4",
  "\u5c31\u7b97",
  "\u867d\u8bf4",
  "\u7b97\u662f",
  "\u610f\u8bc6\u5230",
  "\u610f\u8bc6\u5230",
  "\u7adf\u7136",
  "\u7adf\u7136",
  "\u5f97\u8fc7",
  "\u76f8\u6bd4",
  "\u4e0d\u53ca",
  "\u5c3d\u7ba1",
  "\u5bb6\u4f19",
  "\u9010\u6e10",
  "\u53d6\u51b3\u4e8e",
  "\u7ed9\u4e88",
  "\u8bbe\u5907",
  "\u4e0d\u6210",
  "\u4e0d\u6210",
  "\u4f3c\u7684",
  "\u638c\u63e1",
  "\u4e0d\u7981",
  "\u6d51\u8eab",
  "\u53cd\u6b63",
  "\u5e76\u975e",
  "\u5373\u5c06",
  "\u5f97\u4e0d\u5f97\u4e86",
  "\u6765\u4e0d\u53ca",
  "\u8bb2\u7a76",
  "\u56e0\u4eba\u800c\u5f02",
  "\u89c1\u4ec1\u89c1\u667a",
  "\u56e0\u4eba\u800c\u5f02",
  "\u89c1\u4ec1\u89c1\u667a",
  "\u8d21\u732e",
  "\u6beb\u65e0",
  "\u5934\u6655",
  "\u4e3a\u6b64",
  "\u5178\u578b",
  "\u5a31\u4e50",
  "\u5178\u578b",
  "\u5a01\u80c1",
  "\u81f3\u4e8e",
  "\u4e1d\u6beb",
  "\u6210\u763e",
  "\u6beb\u4e0d",
  "\u63e0\u82d7\u52a9\u957f",
  "\u671b\u6885\u6b62\u6e34",
  "\u8212\u7545",
  "\u4e0d\u8bb8",
  "\u63e0\u82d7\u52a9\u957f",
  "\u671b\u6885\u6b62\u6e34",
  "\u5145\u5206",
  "\u5145\u5206",
  "\u8bf4\u767d\u4e86",
  "\u5145\u5206",
  "\u4e0d\u59a8",
  "\u6bcf\u9694",
  "\u5f97\u4ec0\u4e48\u4f3c\u7684",
  "\u8d8b\u4e8e",
  "\u52a0\u4ee5",
  "\u52a0\u4ee5",
  "\u52a0\u4ee5",
  "\u5d07\u5c1a",
  "\u5d07\u5c1a",
  "\u7eb8\u4e0a\u8c08\u5175",
  "\u9a91\u9a74\u627e\u9a6c",
  "\u7eb8\u4e0a\u8c08\u5175",
  "\u9a91\u9a74\u627e\u9a6c",
  "\u53ca\u5176",
  "\u4e0d\u5c51",
  "\u53cd\u9988",
  "\u8179\u6cfb",
  "\u51fa\u7089",
  "\u5f97\u4e0d\u884c",
  "\u51b7\u6de1",
  "\u5b8f\u4f1f",
  "\u4f20\u5a92",
  "\u6b6a\u66f2",
  "\u7eb3\u95f7",
  "\u989d\u5916",
  "\u7ea0\u6b63",
  "\u96f6\u4e0b",
  "\u4e0d\u81f4",
  "\u2014\u2014\u5219\u2014\u2014",
  "(\u6709/\u65e0) \u6240 V",
  "N \u6240 V",
  "N \u822c",
  "\u4e00\u8a00\u65e2\u51fa\uff0c\u9a77\u9a6c\u96be\u8ffd",
  "\u4e3a\u2014\u2014\u6240\u2014\u2014",
  "\u5175\u5f79",
  "\u5927\u5668\u665a\u6210",
  "\u6240 V",
  "\u6740\u9e21\u5106\u7334",
  "\u7532\u4e59\u4e19\u4e01",
  "\u7741\u773c\u8bf4\u778e\u8bdd",
  "\u5c0a\u5351",
  "\u64a4\u9500",
  "\u76f8\u79f0",
  "\u6382\u65a4\u64ad\u4e24",
  "\u8d2f\u6ce8",
  "\u604d\u5982",
  "\u4e00\u2014\u2014\u518d",
  "A\u5219B",
  "\u9664\u5916",
  "\u4e0d\u6599",
  "\u4e0d\u65e0",
  "\u4e3a\u4e86V1\u800cV2",
  "\u8981\u4e0d/\u4e0d\u7136/\u8981\u4e0d\u7136",
  "\uff5e\u5373\uff5e",
  "\u4e3a\uff5e\u8d77\u89c1",
  "\u975e\uff5e\u4e0d\u53ef",
  "\u8fde\uff5e\u90fd/\u4e5f",
  "\u4e3a\u4e86\uff5e\u5c31/\u800c",
  "V\u8d77",
  "\u597d\u50cf\uff5e\u4f3c\u7684/\u4e00\u6837/\u822c",
  "N\u7eb7\u7eb7",
  "V\u8fc7\u6765",
  "\u6240V\u7684",
  "\u8981\u6570N\u4e86",
  "\u4e3aN\u6240V",
  "\u4e00\u8a00\u65e2\u51fa\uff0c\u9a77\u9a6c\u96be\u8ffd",
  "\u5927\u5668\u665a\u6210",
  "\u6740\u9e21\u5106\u7334",
  "\u7741\u773c\u8bf4\u778e\u8bdd",
  "\u50cf\uff5e\u90a3\u6837\uff5e",
  "\u5929\u4e0b\u65e0\u654c",
  "\u56e0\uff5e\u800c\uff5e",
  "\u8fdeN1\u5e26N2",
  "\u8d4f\u5fc3\u4e50\u4e8b",
  "\u64e6\u80a9\u800c\u8fc7",
  "\u4e3a\u671f\uff5e",
  "\u5305\u62ec\uff5e\u5728\u5185",
  "\u86ee\uff5e\u7684",
  "\u793e\u4f1a",
  "\u4e0d\u4ec5",
  "\u6210\u4e3a",
  "\u597d\u50cf",
  "\u7ecf\u6d4e",
  "\u653f\u5e9c",
  "\u90e8\u5206",
  "\u7ba1\u7406",
  "\u53d1\u751f",
  "\u6559\u80b2",
  "\u767e\u5206\u4e4b",
  "\u7406\u89e3",
  "\u5f53\u65f6",
  "\u54b1\u4eec",
  "\u5f15\u8d77",
  "\u76ee\u7684",
  "\u8d28\u91cf",
  "\u7ee7\u7eed",
  "\u79d1\u5b66",
  "\u7ed3\u679c",
  "\u65e0\u8bba",
  "\u8fdb\u884c",
  "\u8fdb\u884c",
  "\u7ecf\u9a8c",
  "\u5e7f\u544a",
  "\u8d23\u4efb",
  "\u8fc7\u7a0b",
  "\u8003\u8651",
  "\u9002\u5408",
  "\u538b\u529b",
  "\u4e92\u8054\u7f51",
  "\u5e73\u65f6",
  "\u786e\u5b9e",
  "\u786e\u5b9e",
  "\u4e00\u5207",
  "\u590d\u6742",
  "\u4ea4\u6d41",
  "\u4efb\u4f55",
  "\u6b63\u5e38",
  "\u77e5\u8bc6",
  "\u8457\u540d",
  "\u575a\u6301",
  "\u539f\u6765",
  "\u539f\u6765",
  "\u83b7\u5f97",
  "\u8b66\u5bdf",
  "\u8d1f\u8d23",
  "\u52a8\u4f5c",
  "\u652f\u6301",
  "\u652f\u6301",
  "\u4f5c\u7528",
  "\u5de5\u8d44",
  "\u653e\u677e",
  "\u5371\u9669",
  "\u7ade\u4e89",
  "\u7ade\u4e89",
  "\u5171\u540c",
  "\u53e6\u5916",
  "\u53e6\u5916",
  "\u5c0a\u91cd",
  "\u6536\u5165",
  "\u8d2d\u7269",
  "\u8f7b\u677e",
  "\u91cd\u65b0",
  "\u65e2\u7136",
  "\u6c38\u8fdc",
  "\u7b26\u5408",
  "\u5de6\u53f3",
  "\u7cbe\u5f69",
  "\u9ebb\u70e6",
  "\u9ebb\u70e6",
  "\u9ebb\u70e6",
  "\u4e3e\u884c",
  "\u5dee\u4e0d\u591a",
  "\u5dee\u4e0d\u591a",
  "\u5e78\u798f",
  "\u4e92\u76f8",
  "\u5473\u9053",
  "\u65e0\u804a",
  "\u7231\u60c5",
  "\u53cd\u5bf9",
  "\u76ae\u80a4",
  "\u89c4\u5b9a",
  "\u73b0\u91d1",
  "\u7ffb\u8bd1",
  "\u81ea\u7531",
  "\u4f30\u8ba1",
  "\u4fdd\u8bc1",
  "\u4fdd\u8bc1",
  "\u51fa\u751f",
  "\u5e7d\u9ed8",
  "\u5e7d\u9ed8",
  "\u7b7e\u8bc1",
  "\u540c\u60c5",
  "\u5ea7\u4f4d",
  "\u5f8b\u5e08",
  "\u94a5\u5319",
  "\u4eb2\u621a",
  "\u4f5c\u8005",
  "\u51c6\u786e",
  "\u5395\u6240",
  "\u964d\u4f4e",
  "\u968f\u4fbf",
  "\u968f\u4fbf",
  "\u5851\u6599\u888b",
  "\u7adf\u7136",
  "\u5174\u594b",
  "\u52c7\u6562",
  "\u5927\u7ea6",
  "\u5bf9\u8bdd",
  "\u5e7f\u64ad",
  "\u8be6\u7ec6",
  "\u9996\u90fd",
  "\u4ed4\u7ec6",
  "\u5176\u6b21",
  "\u5176\u6b21",
  "\u62b1\u6b49",
  "\u8ddd\u79bb",
  "\u8ddd\u79bb",
  "\u4ed4\u7ec6",
  "\u4e3b\u52a8",
  "\u529f\u592b",
  "\u529f\u592b",
  "\u5931\u8d25",
  "\u5e08\u5085",
  "\u62d2\u7edd",
  "\u8461\u8404",
  "\u8ba4\u771f",
  "\u8ba4\u771f",
  "\u9053\u6b49",
  "\u96be\u53d7",
  "\u987a\u4fbf",
  "\u4eac\u5267",
  "\u53f7\u7801",
  "\u5546\u91cf",
  "\u5ba2\u5385",
  "\u611f\u52a8",
  "\u76d2\u5b50",
  "\u822a\u73ed",
  "\u8868\u683c",
  "\u62db\u8058",
  "\u53ef\u601c",
  "\u53ef\u601c",
  "\u53ef\u601c",
  "\u5468\u56f4",
  "\u6536\u62fe",
  "\u6536\u62fe",
  "\u6c99\u53d1",
  "\u7f3a\u5c11",
  "\u7f3a\u70b9",
  "\u6536\u62fe",
  "\u719f\u6089",
  "\u719f\u6089",
  "\u6765\u4e0d\u53ca",
  "\u901a\u77e5",
  "\u901a\u77e5",
  "\u6765\u4e0d\u53ca",
  "\u901a\u77e5",
  "\u535a\u58eb",
  "\u5730\u5740",
  "\u5835\u8f66",
  "\u6253\u6270",
  "\u6309\u65f6",
  "\u6a61\u76ae",
  "\u7a97\u6237",
  "\u8bda\u5b9e",
  "\u90ae\u5c40",
  "\u997c\u5e72",
  "\u4f9d\u7136",
  "\u52fa\u5b50",
  "\u5408\u683c",
  "\u590d\u5370",
  "\u5bd2\u5047",
  "\u5e72\u676f",
  "\u6253\u9488",
  "\u62a4\u58eb",
  "\u6574\u7406",
  "\u6682\u65f6",
  "\u795d\u8d3a",
  "\u7c97\u5fc3",
  "\u8ff7\u8def",
  "\u987a\u5e8f",
  "\u987a\u5e8f",
  "\u9884\u4e60",
  "\u5783\u573e\u6876",
  "\u653e\u6691\u5047",
  "\u6765\u5f97\u53ca",
  "\u77ff\u6cc9\u6c34",
  "\u897f\u7ea2\u67ff",
  "\u6765\u5f97\u53ca",
  "\u6d3b\u6cfc",
  "\u6d3b\u6cfc",
  "\u4fee\u7406",
  "\u51c9\u5feb",
  "\u51c9\u5feb",
  "\u5bb3\u7f9e",
  "\u679c\u6c41",
  "\u70e4\u9e2d",
  "\u8868\u626c",
  "\u96f6\u94b1",
  "\u9a6c\u864e",
  "\u9a6c\u864e",
  "\u5bb3\u7f9e",
  "\u5403\u60ca",
  "\u5403\u60ca",
  "(\u7531\uff0c\u4ece\uff0c\u81ea)\u2014\u2014\u800c",
  "\u5360\u7ebf",
  "\u8bc1\u540d",
  "\u8bc1\u540d",
  "\u8fd8\u662f",
  "\u81ea\u5df1",
  "\u5927\u5bb6\u90fd",
  "\u4e00\u6837",
  "\u6700\u8fd1",
  "\u5386\u53f2",
  "\u4e00\u5b9a",
  "\u4e86\u89e3",
  "\u7b80\u5355",
  "\u5065\u5eb7",
  "\u5176\u4ed6",
  "\u5f71\u54cd",
  "\u5f71\u54cd",
  "\u5f71\u54cd",
  "\u53c2\u52a0",
  "\u9009\u62e9",
  "\u603b\u662f",
  "\u65b9\u4fbf",
  "\u9a6c\u4e0a",
  "\u6e05\u695a",
  "\u7ec8\u4e8e",
  "\u4e00\u4f1a\u513f",
  "\u52a8\u7269",
  "\u592a\u9633",
  "\u6e38\u620f",
  "\u7ed3\u5a5a",
  "\u540c\u610f",
  "\u7231\u597d",
  "\u6253\u7b97",
  "\u953b\u70bc",
  "\u660e\u767d",
  "\u7ecf\u5e38",
  "\u5317\u65b9",
  "\u7ec3\u4e60",
  "\u8212\u670d",
  "\u6210\u7ee9",
  "\u653e\u5fc3",
  "\u7ed3\u675f",
  "\u58f0\u97f3",
  "\u5b8c\u6210",
  "\u718a\u732b",
  "\u51b0\u7bb1",
  "\u5ba2\u4eba",
  "\u4e2d\u95f4",
  "\u8fdf\u5230",
  "\u5564\u9152",
  "\u516c\u56ed",
  "\u8ba4\u771f",
  "\u886c\u886b",
  "\u793c\u7269",
  "\u5e3d\u5b50",
  "\u76d8\u5b50",
  "\u53f8\u673a",
  "\u591a\u4e48",
  "\u5bb3\u6015",
  "\u76ae\u978b",
  "\u6570\u5b66",
  "\u9ec4\u6cb3",
  "\u5e74\u7ea7",
  "\u88d9\u5b50",
  "\u8bcd\u5178",
  "\u8d77\u98de",
  "\u4e0d\u4f46\u2026\u800c\u4e14\u2026",
  "\u53ea\u6709\u2026\u624d\u2026",
  "\u89c9\u5f97",
  "\u516c\u53f8",
  "\u95ee\u9898",
  "\u65f6\u95f4",
  "\u5f00\u59cb",
  "\u610f\u601d",
  "\u65c5\u6e38",
  "\u665a\u4e0a",
  "\u5e2e\u52a9",
  "\u4f11\u606f",
  "\u65c1\u8fb9",
  "\u65e9\u4e0a",
  "\u8dd1\u6b65",
  "\u6253\u7bee\u7403",
  "\u706b\u8f66\u7ad9",
  "\u5531\u6b4c",
  "\u897f\u74dc",
  "\u4e08\u592b",
  "\u59bb\u5b50",
  "\u53f3\u8fb9",
  "\u94c5\u7b14",
  "\u516c\u5171\u6c7d\u8f66",
  "\u5bbe\u9986",
  "\u7f8a\u8089",
  "\u867d\u7136\u2026\u4f46\u662f\u2026",
  "\u56e0\u4e3a\u2026\u6240\u4ee5\u2026",
  "\u6211\u4eec",
  "\u6ca1\u6709",
  "\u4e2d\u56fd",
  "\u600e\u4e48",
  "\u5de5\u4f5c",
  "\u4e1c\u897f",
  "\u8c22\u8c22",
  "\u540d\u5b57",
  "\u6f02\u4eae",
  "\u600e\u4e48\u6837",
  "\u4e00\u70b9\u513f",
  "\u5148\u751f",
  "\u5206\u949f",
  "\u5973\u513f",
  "\u5bf9\u4e0d\u8d77",
  "\u7238\u7238",
  "\u98de\u673a",
  "\u6253\u7535\u8bdd",
  "\u6ca1\u5173\u7cfb",
  "\u533b\u9662",
  "\u518d\u89c1",
  "\u4e0d\u5ba2\u6c14",
  "\u51fa\u79df\u8f66"
]